app/views/patients/show.html.erb

SELECT "levels".* FROM "levels" WHERE "levels"."diagnosis_id" = ?  [["diagnosis_id", 6]]
SELECT "levels".* FROM "levels" WHERE "levels"."diagnosis_id" = ?  [["diagnosis_id", 2]]
---
                <div class="detail-item"><strong>Fecha:</strong> <%= diagnosis.date %></div>
                <% if diagnosis.levels.present? %>
                  <% diagnosis.levels.each do |level| %>

SELECT "guss_scales".* FROM "guss_scales" WHERE "guss_scales"."diagnosis_id" IN (?, ?, ?, ?, ?)  [["diagnosis_id", 3], ["diagnosis_id", 4], ["diagnosis_id", 5], ["diagnosis_id", 6], ["diagnosis_id", 7]]
---

                <% if diagnosis.guss_scale.present? %>