app/controllers/diagnoses_controller.rb

  def new
    @diagnosis = Diagnosis.new
    @patient = current_user.patients.find(params[:patient_id])
---
SELECT "patients".* FROM "patients" WHERE "patients"."user_id" = ? AND "patients"."id" = ? LIMIT ?  [["user_id", 1], ["id", 2], ["LIMIT", 1]]

  def create
    @patient = current_user.patients.find(params[:diagnosis][:patient_id])
    @diagnosis = @patient.diagnoses.build(diagnosis_params)
    @diagnosis.date = Date.today
    if @diagnosis.save
---
SELECT "patients".* FROM "patients" WHERE "patients"."user_id" = ? AND "patients"."id" = ? LIMIT ?  [["user_id", 1], ["id", 2], ["LIMIT", 1]]
INSERT INTO "diagnoses" ("patient_id", "description", "date", "created_at", "updated_at", "historia_desde", "perdida_peso", "historia_condicion", "historia_cirugia", "sintomas_episodios", "sintomas_dificultad", "sintomas_sensacion", "sintomas_dolor", "sintomas_frecuencia", "sintomas_evita_alimentos", "sintomas_cansancio", "sintomas_tiempo", "sintomas_nuevo") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

  def intermediate_view
    @patient = current_user.patients.find(params[:patient_id])
    @diagnosis = @patient.diagnoses.find(params[:id])
---
SELECT "patients".* FROM "patients" WHERE "patients"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]
SELECT "diagnoses".* FROM "diagnoses" WHERE "diagnoses"."patient_id" = ? AND "diagnoses"."id" = ? LIMIT ?  [["patient_id", 2], ["id", 3], ["LIMIT", 1]]
SELECT "patients".* FROM "patients" WHERE "patients"."user_id" = ? AND "patients"."id" = ? LIMIT ?  [["user_id", 1], ["id", 2], ["LIMIT", 1]]