app/controllers/diagnoses_controller.rb

    def set_patient
      @patient = current_user.patients.find(params[:patient_id])
---
SELECT "patients".* FROM "patients" WHERE "patients"."user_id" = ?  [["user_id", 1]]