app/controllers/guss_scales_controller.rb

  def create
    @guss_scale = @diagnosis.build_guss_scale(guss_scale_params)
    if @guss_scale.save
---
INSERT INTO "guss_scales" ("vigilance", "cough", "saliva_swallow", "sialorrhea", "voice_changes", "semi_solids_swallow", "semi_solids_cough", "semi_solids_sialorrhea", "semi_solids_voice_changes", "liquids_swallow", "liquids_cough", "liquids_sialorrhea", "liquids_voice_changes", "solids_swallow", "solids_cough", "solids_sialorrhea", "solids_voice_changes", "diagnosis_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

  def update
    if @guss_scale.update(guss_scale_params)
---
UPDATE "guss_scales" SET "semi_solids_swallow" = ?, "semi_solids_cough" = ?, "semi_solids_sialorrhea" = ?, "semi_solids_voice_changes" = ?, "updated_at" = ? WHERE "guss_scales"."id" = ?  [["semi_solids_swallow", 2], ["semi_solids_cough", 0], ["semi_solids_sialorrhea", 0], ["semi_solids_voice_changes", 0], ["updated_at", "2024-06-06 21:29:29.963486"], ["id", 1]]

  def intermediate_view
    @diagnosis = Diagnosis.find(params[:diagnosis_id])
    @guss_scale = GussScale.find(params[:id])
---
SELECT "guss_scales".* FROM "guss_scales" WHERE "guss_scales"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]

  def set_guss_scale
    @guss_scale = GussScale.find(params[:id])
---
SELECT "guss_scales".* FROM "guss_scales" WHERE "guss_scales"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]