app/controllers/levels_controller.rb

    def create
      @level = @diagnosis.levels.build(level_params)
      if @level.save
---
INSERT INTO "levels" ("escala", "severidad", "diagnosis_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["escala", "fils"], ["severidad", 3], ["diagnosis_id", 2], ["created_at", "2024-06-12 15:47:42.748225"], ["updated_at", "2024-06-12 15:47:42.748225"]]