app/controllers/pages_controller.rb

SELECT "patients".* FROM "patients"
---
  def diagnostico
    @patients = Patient.all