app/controllers/patients_controller.rb

  def show
    @patient = current_user.patients.find(params[:id])
    @has_diagnosis_with_levels = @patient.diagnoses.any? { |d| d.levels.present? }
    @diagnosis_data = @patient.diagnoses.includes(:levels).map do |diagnosis|
      {
        date: diagnosis.date,
        levels: diagnosis.levels.map { |level| { escala: level.escala, severidad: level.severidad } }
---
SELECT "diagnoses"."date" FROM "diagnoses" WHERE "diagnoses"."patient_id" = ? AND 1=1  [["patient_id", 5]]

  def create
    @patient = current_user.patients.build(patient_params)
    if @patient.save
---
INSERT INTO "patients" ("name", "rut", "birthdate", "sex", "email", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)