app/controllers/patients_controller.rb

SELECT "patients".* FROM "patients" WHERE "patients"."user_id" = ? AND "patients"."id" = ? LIMIT ?  [["user_id", 1], ["id", 1], ["LIMIT", 1]]
SELECT "diagnoses".* FROM "diagnoses" WHERE "diagnoses"."patient_id" = ?  [["patient_id", 5]]
SELECT "levels".* FROM "levels" WHERE "levels"."diagnosis_id" IN (?, ?)  [["diagnosis_id", 2], ["diagnosis_id", 3]]
SELECT "levels".* FROM "levels" WHERE "levels"."diagnosis_id" = ?  [["diagnosis_id", 2]]
SELECT "diagnoses".* FROM "diagnoses" WHERE "diagnoses"."patient_id" = ?  [["patient_id", 1]]
SELECT "levels".* FROM "levels" WHERE "levels"."diagnosis_id" IN (?, ?, ?)  [["diagnosis_id", 1], ["diagnosis_id", 2], ["diagnosis_id", 3]]
SELECT "guss_scales".* FROM "guss_scales" WHERE "guss_scales"."diagnosis_id" IN (?, ?, ?, ?, ?)  [["diagnosis_id", 3], ["diagnosis_id", 4], ["diagnosis_id", 5], ["diagnosis_id", 6], ["diagnosis_id", 7]]
---
  def show
    @patient = current_user.patients.find(params[:id])
    @has_diagnosis_with_levels = @patient.diagnoses.any? { |d| d.levels.present? }

    all_scales = @patient.diagnoses.flat_map { |diagnosis| diagnosis.levels.map(&:escala) }.uniq

    @diagnosis_data = @patient.diagnoses.includes(:levels).map do |diagnosis|
      level_data = all_scales.map do |scale|
        level = diagnosis.levels.find { |l| l.escala == scale }
        level ? level.severidad : nil
      end
      { date: diagnosis.date, levels: level_data }
    end

    @scales = all_scales
    @diagnoses = @patient.diagnoses.includes(:guss_scale)

INSERT INTO "patients" ("name", "rut", "birthdate", "sex", "email", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @patient = current_user.patients.build(patient_params)
    if @patient.save

SELECT "patients".* FROM "patients" WHERE "patients"."user_id" = ? AND "patients"."id" = ? LIMIT ?  [["user_id", 1], ["id", 1], ["LIMIT", 1]]
---
  def export
    @patients = current_user.patients.includes(diagnoses: :guss_scale)

SELECT "patients".* FROM "patients" WHERE "patients"."user_id" = ? AND "patients"."id" = ? LIMIT ?  [["user_id", 1], ["id", 1], ["LIMIT", 1]]
---
  def set_patient
    @patient = current_user.patients.find(params[:id])

SELECT "diagnoses".* FROM "diagnoses" WHERE "diagnoses"."patient_id" IN (?, ?)  [["patient_id", 1], ["patient_id", 2]]
SELECT "levels".* FROM "levels" WHERE "levels"."diagnosis_id" = ?  [["diagnosis_id", 1]]
SELECT 1 AS one FROM "levels" WHERE "levels"."diagnosis_id" = ? LIMIT ?  [["diagnosis_id", 1], ["LIMIT", 1]]
SELECT "levels".* FROM "levels" WHERE "levels"."diagnosis_id" = ?  [["diagnosis_id", 3]]
SELECT "guss_scales".* FROM "guss_scales" WHERE "guss_scales"."diagnosis_id" IN (?, ?, ?)  [["diagnosis_id", 1], ["diagnosis_id", 2], ["diagnosis_id", 3]]
---
  def generate_csv(patients)
    headers = ["Nombre", "RUT", "Fecha de Nacimiento", "Sexo", "Email", "Fecha del Diagnóstico", "Descripción", "Historia Desde", "Pérdida de Peso", "Historia de Condición", "Historia de Cirugía", "Episodios de Atragantamiento o Tos", "Dificultad para Tragar", "Sensación de Comida Atascada", "Dolor al Tragar", "Frecuencia de Problemas para Tragar", "Evita Alimentos", "Cansancio al Comer o Beber", "Tiempo para Almorzar", "Nuevos Síntomas", "Escala", "Severidad", "Puntaje Total GUSS"]

    CSV.generate(headers: true) do |csv|
      csv << headers

      patients.each do |patient|
        if patient.diagnoses.any?
          patient.diagnoses.each do |diagnosis|
            if diagnosis.levels.any?
              diagnosis.levels.each do |level|
                guss = diagnosis.guss_scale
                guss_total = guss.present? ? guss.total_score : nil